# PANDAS FULL GUIDE 1.1
## THE BASICS

In this guide, we will explore the fundamental concepts and basics of the Pandas library. I hope you find this resource valuable. Should you have any questions or feedback, please feel free to contact me at [sania.latifia@gmail.com](mailto:sania.latifia@gmail.com).

In this tutorial our example is going to be a database of Top 20 Movies on IMDB

Before we begin, it is important to familiarize yourself with certain parameters as we will be introducing various methods and their syntax:<br>
* ```index :  row label```
* ```col :  column label```
* ```value :  scalar value```
* ```takeable :   interpret the index/col as indexers, default False```

***

### Import Pandas

In [57]:
import pandas as pd

In [58]:
top_20_imdb = {'movie' : ['The Lord of The Rings', 'The Shawshank Redemption', 'Gladiator', 'Untouchable', 'Forrest Gump', 'The Lord of the Rings: The Return of the King', 'The Prestige', 'The Dark Knight', 'The Godfather', 'The Matrix', "Schindler's List", 'Seven', 'The Green Mile', 'Interstellar', 'Bridge of Spies', 'Murder on the Orient Express', 'V For Vendetta', 'Life Is Beautiful', 'The Silence of the Lambs', 'Back to the Future'],
              'director' : ['Peter Jackson', 'Frank Darabont', 'Ridley Scott', 'Olivier Nakache', 'Robert Zemeckis', 'Peter Jackson', 'Christopher Nolan', 'Christopher Nolan', 'Francis Ford Coppola', 'Lana Wachowski', 'Steven Spielberg', 'David Fincher', 'Frank Darabont', 'Christopher Nolan', 'Steven Spielberg', 'Kenneth Branagh', 'James McTeigue', 'Roberto Benigni', 'Jonathan Demme', 'Robert Zemeckis'],
              'rating' : [8.9, 9.3, 8.5, 8.5, 8.8, 9.0, 8.5, 9.0, 9.2, 8.7, 9.0, 8.6, 8.6, 8.7, 7.6, 6.5, 8.1, 8.6, 8.6, 8.5],
              'genre' : ['Fantasy', 'Drama', 'Action', 'Comedy', 'Romance', 'Fantasy', 'Thriller', 'Crime', 'Gangster', 'Sci-Fi', 'Biography', 'Crime', 'Mystery', 'Sci-Fi', 'Drama', 'Thriller', 'Sci-Fi', 'Romance', 'Crime', 'Comedy']}

In [59]:
df = pd.DataFrame(top_20_imdb)
df

,movie,director,rating,genre
0,The Lord of The Rings,Peter Jackson,8.9,Fantasy
1,The Shawshank Redemption,Frank Darabont,9.3,Drama
2,Gladiator,Ridley Scott,8.5,Action
3,Untouchable,Olivier Nakache,8.5,Comedy
4,Forrest Gump,Robert Zemeckis,8.8,Romance
5,The Lord of the Rings: The Return of the King,Peter Jackson,9.0,Fantasy
6,The Prestige,Christopher Nolan,8.5,Thriller
7,The Dark Knight,Christopher Nolan,9.0,Crime
8,The Godfather,Francis Ford Coppola,9.2,Gangster
9,The Matrix,Lana Wachowski,8.7,Sci-Fi
10,Schindler's List,Steven Spielberg,9.0,Biography
11,Seven,David Fincher,8.6,Crime
12,The Green Mile,Frank Darabont,8.6,Mystery
13,Interstellar,Christopher Nolan,8.7,Sci-Fi
14,Bridge of Spies,Steven Spielberg,7.6,Drama
15,Murder on the Orient Express,Kenneth Branagh,6.5,Thriller
16,V For Vendetta,James McTeigue,8.1,Sci-Fi
17,Life Is Beautiful,Roberto Benigni,8.6,Romance
18,The Silence of the Lambs,Jonathan Demme,8.6,Crime
19,Back to the Future,Robert Zemeckis,8.5,Comedy

The code above displays a table created using Pandas' `DataFrame()` method, which accepts a dictionary as a data argument. To specify labels as indices, you can include an 'index' attribute, as illustrated below:

In [60]:
lables = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'g', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't']
df = pd.DataFrame(top_20_imdb, index=lables)
df.head() # Using the head() method to display the first five rows only.
# You can cusotmize this value by changing it in the parantheses. for example head(3) will give you the first three rows

                      movie         director  rating    genre
a     The Lord of The Rings    Peter Jackson     8.9  Fantasy
b  The Shawshank Redemption   Frank Darabont     9.3    Drama
c                 Gladiator     Ridley Scott     8.5   Action
d               Untouchable  Olivier Nakache     8.5   Comedy
e              Forrest Gump  Robert Zemeckis     8.8  Romance

For the sake of this guide we will stick to the first DataFrame.

In [61]:
df = pd.DataFrame(top_20_imdb)
df.head()

                      movie         director  rating    genre
0     The Lord of The Rings    Peter Jackson     8.9  Fantasy
1  The Shawshank Redemption   Frank Darabont     9.3    Drama
2                 Gladiator     Ridley Scott     8.5   Action
3               Untouchable  Olivier Nakache     8.5   Comedy
4              Forrest Gump  Robert Zemeckis     8.8  Romance

For each type of file there's a method in pandas to create a dataframe:
* `CSV FILES` -> `read_csv('filename.csv')`
* `EXCEL` -> `read_excel('filename.xlsx')`
* `PARQUET` -> `read_parquet('filename.parquet')`
* `FEATHER` -> `read_feather('filename.feather')`
<br> Similarily, you can convert your dataframe to any format using pandas' `to_csv`, `to_excel`, `to_parquet`, etc.

We can select various sections of our DataFrame. In the following code, we are selecting the `'movie'` column along with the `'rating'` column to display each movie and its corresponding rating.

In [62]:
df[['movie', 'rating']].head()

                      movie  rating
0     The Lord of The Rings     8.9
1  The Shawshank Redemption     9.3
2                 Gladiator     8.5
3               Untouchable     8.5
4              Forrest Gump     8.8

There is a specific reason for using two brackets in the cell above: When selecting multiple columns for display, the column names must be placed inside a list and then enclosed within `df[]`. Using double brackets returns a DataFrame, while using single brackets for a single column returns that column as a Series.

#### Before we delve into data manipulation, it is important to understand how to gather information about our DataFrame.

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   movie     20 non-null     object
 1   director  20 non-null     object
 2   rating    20 non-null     float64
 3   genre     20 non-null     object
dtypes: float64(1), object(3)
memory usage: 772.0+ bytes

#### The info() function gives us information about the datatype of the values inside each column.
For example, in our movie DataFrame, the 'rating' column has a `float64` datatype. We can change this datatype to reduce memory usage. There are two approaches to achieve this:

1. Change all columns' datatypes to `float32`. This method is effective for DataFrames where all columns consist solely of floats or integers. However, since our DataFrame also contains object datatypes, this approach would result in an error.

2. Select only the columns that are of type `float64` and convert those specific columns.

In [64]:
float64_cols = list(df.select_dtypes(include='float64'))
df[float64_cols] = df[float64_cols].astype('float32')

We utilize the `list()` and `select_dtypes()` functions to create a list of all the data that are of type `float64`. In the subsequent line, we will select this list and employ the `astype()` function to convert the datatypes to `float32`.

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   movie     20 non-null     object
 1   director  20 non-null     object
 2   rating    20 non-null     float32
 3   genre     20 non-null     object
dtypes: float32(1), object(3)
memory usage: 692.0+ bytes

As you can observe, our `'rating'` column has been updated to a `float32` data type, which has resulted in a slight reduction in memory usage for our dataframe.

#### LOC() AND ILOC()

To display specific sections of your DataFrame, one efficient approach is to utilize the `loc()` and `iloc()` functions in pandas. For instance, if we want to display only the first two rows and the first two columns, we can achieve this using the `loc()` function as follows:

In [66]:
df.loc[:1, ['movie', 'genre']]

                      movie    genre
0     The Lord of The Rings  Fantasy
1  The Shawshank Redemption    Drama

Please note that when slicing with `loc()`, the end index is *inclusive*. 

**Important:** The `loc()` function in pandas is primarily label-based, meaning it operates using column names (labels) rather than numerical indices. Consequently, you cannot directly slice columns using their numerical indices with `loc`. However, you can slice rows in this manner.

If you need to select columns by their position or through slicing, you should utilize `iloc()`. For example, to display the first five rows and all columns from 'director' to 'genre' (corresponding to indices 1 and 3), you can use the following approach:

In [67]:
df.iloc[:5, 1:4]

          director  rating    genre
0    Peter Jackson     8.9  Fantasy
1   Frank Darabont     9.3    Drama
2     Ridley Scott     8.5   Action
3  Olivier Nakache     8.5   Comedy
4  Robert Zemeckis     8.8  Romance

As you can see in the code above, the end index in iloc() is exclusive. And you can use it to slice both columns and rows. But you can't use columns' labels to display them.<br>To summarize:
* Use `loc()` for selecting columns by their names.
* Use `iloc()` for slicing columns by integer positions.

Let's say we want to replace the rating values of the first 4 rows to NaN:

In [68]:
import numpy as np
df_copy = df.copy()
df_copy.loc[:3, ['rating']] = np.nan
df_copy.head()

                      movie         director  rating    genre
0     The Lord of The Rings    Peter Jackson     NaN  Fantasy
1  The Shawshank Redemption   Frank Darabont     NaN    Drama
2                 Gladiator     Ridley Scott     NaN   Action
3               Untouchable  Olivier Nakache     NaN   Comedy
4              Forrest Gump  Robert Zemeckis     8.8  Romance

Now to re-fill NaN values, we use the `fillna()` method:

In [69]:
df_copy = df_copy.fillna(9)
df_copy.head()

                      movie         director  rating    genre
0     The Lord of The Rings    Peter Jackson     9.0  Fantasy
1  The Shawshank Redemption   Frank Darabont     9.0    Drama
2                 Gladiator     Ridley Scott     9.0   Action
3               Untouchable  Olivier Nakache     9.0   Comedy
4              Forrest Gump  Robert Zemeckis     8.8  Romance

Let's get back to our original dataframe and get all the movies in which the rating in *between 6 and 8* (8 being exclusive):

In [70]:
df_new = df.copy()
df_new[df_new['rating'].between(6, 8)]

                           movie          director  rating     genre
14               Bridge of Spies  Steven Spielberg     7.6     Drama
15  Murder on the Orient Express   Kenneth Branagh     6.5  Thriller

Now how about we get all the movies in which the director is Christopher Nolan and the rating is higher than 8:

In [71]:
df_new = df.copy()
df_new[(df_new['director'] == 'Christopher Nolan') & (df_new['rating'] > 8)]

              movie           director  rating     genre
6      The Prestige  Christopher Nolan     8.5  Thriller
7   The Dark Knight  Christopher Nolan     9.0     Crime
13     Interstellar  Christopher Nolan     8.7    Sci-Fi

If we were to change the order in which the columns appear, we could do the following:

In [72]:
df_new = df[['genre', 'rating', 'director', 'movie']]
df_new.head()

     genre  rating         director                     movie
0  Fantasy     8.9    Peter Jackson     The Lord of The Rings
1    Drama     9.3   Frank Darabont  The Shawshank Redemption
2   Action     8.5     Ridley Scott                 Gladiator
3   Comedy     8.5  Olivier Nakache               Untouchable
4  Romance     8.8  Robert Zemeckis              Forrest Gump

#### GROUPBY()
_Syntax: DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=False, **kwargs)_ <br><br>
The groupby object is a _dictionary_ that groups a DataFrame by a specific column. for example we have a DataFrame of Top 20 Movies of All Time, and some of these movies have the same genres. If we were to organize this DataFrame by their genres, `groupby()` method would be an apt approach.<br> See the following example(Note that the number of rows in each group of `groupby()` object can be easily obtained using the function `.size()`, The method simply counts the number of rows in each group):

In [73]:
df_new = df.groupby(['genre']).size()
df_new

genre
Action       1
Biography    1
Comedy       2
Crime        3
Drama        2
Fantasy      2
Gangster     1
Mystery      1
Romance      2
Sci-Fi       3
Thriller     2
dtype: int64

You can see that what we get is a series of genres and the number of existing movies in our DataFrame with that genre.<br>Similar results can be obtained using an aggregate function `count()`:

In [74]:
df_new = df.groupby(['genre']).count()
df_new

           movie  director  rating
genre
Action         1         1       1
Biography      1         1       1
Comedy         2         2       2
Crime          3         3       3
Drama          2         2       2
Fantasy        2         2       2
Gangster       1         1       1
Mystery        1         1       1
Romance        2         2       2
Sci-Fi         3         3       3
Thriller       2         2       2

The aggregate function `.count()` counts only the non-null values from each column, whereas `.size()` simply returns the number of rows available in each group irrespective of presence or absence of values. If you want to see how many non-null values are present in each column of each group, use `.count()`. Otherwise, use `.size()`.

A bit earlier we learned how to get all the rows where `'director'` is "Christopher Nolan", we did something similar to the follwing:

In [75]:
df_new = df[df['director'] == 'Christopher Nolan']
df_new

              movie           director  rating     genre
6      The Prestige  Christopher Nolan     8.5  Thriller
7   The Dark Knight  Christopher Nolan     9.0     Crime
13     Interstellar  Christopher Nolan     8.7    Sci-Fi

We can do the exact thing using the ```.get_group()``` method<br>This method is more time-efficient. In fact, slicing with ```.groupby()``` and ```.get_group()``` is four times faster than with logical comparison.

In [76]:
df_new = df.groupby('director')
df_new.get_group('Christopher Nolan')

              movie           director  rating     genre
6      The Prestige  Christopher Nolan     8.5  Thriller
7   The Dark Knight  Christopher Nolan     9.0     Crime
13     Interstellar  Christopher Nolan     8.7    Sci-Fi

#### AT[] and IAT[]
Access a single value for a row/column pair by integer position.

Similar to loc and iloc, in that both provide integer-based lookups. Use `at/iat` if you only need to get or set a single value in a DataFrame or Series.<br>
Here, we want to access the genre of the row that has the index 1:

In [77]:
df.head()

                      movie         director  rating    genre
0     The Lord of The Rings    Peter Jackson     8.9  Fantasy
1  The Shawshank Redemption   Frank Darabont     9.3    Drama
2                 Gladiator     Ridley Scott     8.5   Action
3               Untouchable  Olivier Nakache     8.5   Comedy
4              Forrest Gump  Robert Zemeckis     8.8  Romance

In [78]:
df_new = df.at[1, 'genre']
df_new

'Drama'

Accessing the movie 'The Shawshank Redemption':

In [79]:
df_new = df.iat[1, 0]
df_new

'The Shawshank Redemption'

Now let's say we want to shuffle our rows. That's where we can use the ```sample()``` method. <br>_Syntax: DataFrame.sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None, ignore_index=False)_<br><br> It essentially returns a random sample of items from an axis of object.

In [80]:
df_new = df.sample(frac=1)
df_new.head()

                       movie           director  rating     genre
11                     Seven      David Fincher     8.6     Crime
1   The Shawshank Redemption     Frank Darabont     9.3     Drama
0      The Lord of The Rings      Peter Jackson     8.9   Fantasy
6               The Prestige  Christopher Nolan     8.5  Thriller
17         Life Is Beautiful    Roberto Benigni     8.6   Romance

This approach can be beneficial in certain scenarios; however, for the purposes of this guide, we prefer to maintain an organized DataFrame. Therefore, we will focus on additional functionalities of the `sample()` method. Let’s explore how to extract four random elements from the Series `df['movie']`.

In [81]:
df_new = df['movie'].sample(n=4, random_state=1)
df_new

3          Untouchable
16      V For Vendetta
6         The Prestige
10    Schindler's List
Name: movie, dtype: object

by using the parameter ```random_state```, we can generate the same random results each time the code is run. It's essentially to ensure the reproducibility of results.<br>Now, how about a random 50% sample of the DataFrame with replacement:

In [82]:
df_new = df.sample(frac=0.5, replace=True, random_state=1)
df_new

,movie,director,rating,genre
5,The Lord of the Rings: The Return of the King,Peter Jackson,9.0,Fantasy
11,Seven,David Fincher,8.6,Crime
12,The Green Mile,Frank Darabont,8.6,Mystery
8,The Godfather,Francis Ford Coppola,9.2,Gangster
9,The Matrix,Lana Wachowski,8.7,Sci-Fi
11,Seven,David Fincher,8.6,Crime
5,The Lord of the Rings: The Return of the King,Peter Jackson,9.0,Fantasy
15,Murder on the Orient Express,Kenneth Branagh,6.5,Thriller
0,The Lord of The Rings,Peter Jackson,8.9,Fantasy
16,V For Vendetta,James McTeigue,8.1,Sci-Fi

"With replacement" means that after an element is selected from the DataFrame, it is returned to the pool of available elements before the next selection. This allows the same element to be chosen more than once in the sample.

#### RENAME()
_Syntax: DataFrame.rename(mapper=None, *, index=None, columns=None, axis=None, copy=None, inplace=False, level=None, errors='ignore')_<br><br>We use this method to rename columns or index labels.

In [83]:
# Renaming a column
df_new = df.rename(columns={'movie': 'film'})
df_new.head(3)

                       film        director  rating    genre
0     The Lord of The Rings   Peter Jackson     8.9  Fantasy
1  The Shawshank Redemption  Frank Darabont     9.3    Drama
2                 Gladiator    Ridley Scott     8.5   Action

In [84]:
# Renaming an index
df_new = df.rename(index={0:"zero", 1:"one", 2:"two"})
df_new.head(3)

                         movie        director  rating    genre
zero     The Lord of The Rings   Peter Jackson     8.9  Fantasy
one   The Shawshank Redemption  Frank Darabont     9.3    Drama
two                  Gladiator    Ridley Scott     8.5   Action

#### TOLIST()
Let's see how we can get a list of a specified column of a DataFrame using the ```tolist()``` method.<br>We're going to try and get a list of the ```'genre'``` column:

In [85]:
genre_list = df['genre'].tolist()
print(genre_list)

['Fantasy', 'Drama', 'Action', 'Comedy', 'Romance', 'Fantasy', 'Thriller', 'Crime', 'Gangster', 'Sci-Fi', 'Biography', 'Crime', 'Mystery', 'Sci-Fi', 'Drama', 'Thriller', 'Sci-Fi', 'Romance', 'Crime', 'Comedy']

This concludes the first part of "The Full Guide to Pandas: The Basics." A second part of this series will follow, after which we will delve into more advanced concepts. You can contact me via [Email](sania.latifia@gmail.com) for further questions and/or feedback! Thank you for your engagement.